app/controllers/api/v1/game_archives_controller.rb

  def update
    if @game_archive.update(game_archive_params)
---
UPDATE "game_archives" SET "game_name" = $1, "updated_at" = $2 WHERE "game_archives"."id" = $3  [["game_name", "Sekigahara"], ["updated_at", "2019-04-12 07:06:22.379982"], ["id", 1]]

  def set_game_archive
    @game_archive = GameArchive.find(params[:id])
---
SELECT  "game_archives".* FROM "game_archives" WHERE "game_archives"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]