app/controllers/pages_controller.rb

SELECT  "game_archives".* FROM "game_archives" ORDER BY "game_archives"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @game_archives = GameArchive.all